{
  "auto_mapping": null,
  "base_model_name_or_path": "THUDM/glm-4-9b-chat",
  "encoder_hidden_size": 256,
  "inference_mode": true,
  "num_attention_heads": 2,
  "num_layers": 40,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 512,
  "peft_type": "PREFIX_TUNING",
  "prefix_projection": false,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 256
}